ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fg6426.h
#define CBPD8_H             (0x0001)  /* Comp. B Disable Input Buffer of Port Register .8 */
#define CBPD9_H             (0x0002)  /* Comp. B Disable Input Buffer of Port Register .9 */
#define CBPD10_H            (0x0004)  /* Comp. B Disable Input Buffer of Port Register .10 */
#define CBPD11_H            (0x0008)  /* Comp. B Disable Input Buffer of Port Register .11 */
#define CBPD12_H            (0x0010)  /* Comp. B Disable Input Buffer of Port Register .12 */
#define CBPD13_H            (0x0020)  /* Comp. B Disable Input Buffer of Port Register .13 */
#define CBPD14_H            (0x0040)  /* Comp. B Disable Input Buffer of Port Register .14 */
#define CBPD15_H            (0x0080)  /* Comp. B Disable Input Buffer of Port Register .15 */


/* CBINT Control Bits */
#define CBIFG                (0x0001)  /* Comp. B Interrupt Flag */
#define CBIIFG               (0x0002)  /* Comp. B Interrupt Flag Inverted Polarity */
//#define RESERVED             (0x0004)  /* Comp. B */
//#define RESERVED             (0x0008)  /* Comp. B */
//#define RESERVED             (0x0010)  /* Comp. B */
//#define RESERVED             (0x0020)  /* Comp. B */
//#define RESERVED             (0x0040)  /* Comp. B */
//#define RESERVED             (0x0080)  /* Comp. B */
#define CBIE                 (0x0100)  /* Comp. B Interrupt Enable */
#define CBIIE                (0x0200)  /* Comp. B Interrupt Enable Inverted Polarity */
//#define RESERVED             (0x0400)  /* Comp. B */
//#define RESERVED             (0x0800)  /* Comp. B */
//#define RESERVED             (0x1000)  /* Comp. B */
//#define RESERVED             (0x2000)  /* Comp. B */
//#define RESERVED             (0x4000)  /* Comp. B */
//#define RESERVED             (0x8000)  /* Comp. B */

/* CBINT Control Bits */
#define CBIFG_L             (0x0001)  /* Comp. B Interrupt Flag */
#define CBIIFG_L            (0x0002)  /* Comp. B Interrupt Flag Inverted Polarity */
//#define RESERVED             (0x0004)  /* Comp. B */
//#define RESERVED             (0x0008)  /* Comp. B */
//#define RESERVED             (0x0010)  /* Comp. B */
//#define RESERVED             (0x0020)  /* Comp. B */
//#define RESERVED             (0x0040)  /* Comp. B */
//#define RESERVED             (0x0080)  /* Comp. B */
//#define RESERVED             (0x0400)  /* Comp. B */
//#define RESERVED             (0x0800)  /* Comp. B */
//#define RESERVED             (0x1000)  /* Comp. B */
//#define RESERVED             (0x2000)  /* Comp. B */
//#define RESERVED             (0x4000)  /* Comp. B */
//#define RESERVED             (0x8000)  /* Comp. B */

/* CBINT Control Bits */
//#define RESERVED             (0x0004)  /* Comp. B */
//#define RESERVED             (0x0008)  /* Comp. B */
//#define RESERVED             (0x0010)  /* Comp. B */
//#define RESERVED             (0x0020)  /* Comp. B */
//#define RESERVED             (0x0040)  /* Comp. B */
//#define RESERVED             (0x0080)  /* Comp. B */
#define CBIE_H              (0x0001)  /* Comp. B Interrupt Enable */
#define CBIIE_H             (0x0002)  /* Comp. B Interrupt Enable Inverted Polarity */
//#define RESERVED             (0x0400)  /* Comp. B */
//#define RESERVED             (0x0800)  /* Comp. B */
//#define RESERVED             (0x1000)  /* Comp. B */
//#define RESERVED             (0x2000)  /* Comp. B */
//#define RESERVED             (0x4000)  /* Comp. B */
//#define RESERVED             (0x8000)  /* Comp. B */

/* CBIV Definitions */
#define CBIV_NONE           (0x0000)    /* No Interrupt pending */
#define CBIV_CBIFG          (0x0002)    /* CBIFG */
#define CBIV_CBIIFG         (0x0004)    /* CBIIFG */

/*************************************************************
* CRC Module
*************************************************************/
#define __MSP430_HAS_CRC__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CRC__ 0x0150
#define CRC_BASE __MSP430_BASEADDRESS_CRC__

#define CRCDI_                0x0150    /* CRC Data In Register */
sfrb(CRCDI_L , CRCDI_);
sfrb(CRCDI_H , CRCDI_+1);
sfrw(CRCDI, CRCDI_);
#define CRCDIRB_              0x0152    /* CRC data in reverse byte Register */
sfrb(CRCDIRB_L , CRCDIRB_);
sfrb(CRCDIRB_H , CRCDIRB_+1);
sfrw(CRCDIRB, CRCDIRB_);
#define CRCINIRES_            0x0154    /* CRC Initialisation Register and Result Register */
sfrb(CRCINIRES_L , CRCINIRES_);
sfrb(CRCINIRES_H , CRCINIRES_+1);
sfrw(CRCINIRES, CRCINIRES_);
#define CRCRESR_              0x0156    /* CRC reverse result Register */
sfrb(CRCRESR_L , CRCRESR_);
sfrb(CRCRESR_H , CRCRESR_+1);
sfrw(CRCRESR, CRCRESR_);

/************************************************************
* CTSD16 - Sigma Delta 16 Bit
************************************************************/
#define __MSP430_HAS_CTSD16__         /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_CTSD16__ 0x0A80
#define CTSD16_BASE __MSP430_BASEADDRESS_CTSD16__
#define __MSP430_HAS_CTSD16_0__     /* Definition to show that Module is available */

#define CTSD16CTL_            0x0A80    /* CTSD16 Control Register 0 */
sfrb(CTSD16CTL_L , CTSD16CTL_);
sfrb(CTSD16CTL_H , CTSD16CTL_+1);
sfrw(CTSD16CTL, CTSD16CTL_);
#define CTSD16IFG_            0x0AAC    /* CTSD16 Interrupt Flag Register */
sfrb(CTSD16IFG_L , CTSD16IFG_);
sfrb(CTSD16IFG_H , CTSD16IFG_+1);
sfrw(CTSD16IFG, CTSD16IFG_);
#define CTSD16IE_             0x0AAE    /* CTSD16 Interrupt Enable Register */
sfrb(CTSD16IE_L , CTSD16IE_);
sfrb(CTSD16IE_H , CTSD16IE_+1);
sfrw(CTSD16IE, CTSD16IE_);
#define CTSD16IV_             0x0AB0    /* CTSD16 Interrupt Vector Register */
sfrb(CTSD16IV_L , CTSD16IV_);
sfrb(CTSD16IV_H , CTSD16IV_+1);
sfrw(CTSD16IV, CTSD16IV_);

#define CTSD16CCTL0_          0x0A82    /* CTSD16 Channel 0 Control Register */
sfrb(CTSD16CCTL0_L , CTSD16CCTL0_);
sfrb(CTSD16CCTL0_H , CTSD16CCTL0_+1);
sfrw(CTSD16CCTL0, CTSD16CCTL0_);
#define CTSD16MEM0_           0x0AB2    /* CTSD16 Channel 0 Conversion Memory */
sfrb(CTSD16MEM0_L , CTSD16MEM0_);
sfrb(CTSD16MEM0_H , CTSD16MEM0_+1);
sfrw(CTSD16MEM0, CTSD16MEM0_);
#define CTSD16INCTL0_         0x0A84    /* CTSD16 Channel 0 Input Control Register */
sfrb(CTSD16INCTL0_L , CTSD16INCTL0_);
sfrb(CTSD16INCTL0_H , CTSD16INCTL0_+1);
sfrw(CTSD16INCTL0, CTSD16INCTL0_);
#define CTSD16PRE0_           0x0A86    /* CTSD16 Channel 0 Preload Register */
sfrb(CTSD16PRE0_L , CTSD16PRE0_);
sfrb(CTSD16PRE0_H , CTSD16PRE0_+1);
sfrw(CTSD16PRE0, CTSD16PRE0_);


/* CTSD16CTL */
#define CTSD16REFS            (0x0004)  /* CTSD16 reference select */
#define CTSD16CLKR            (0x0008)  /* CTSD16CLK resistor select */
#define CTSD16OFFG            (0x0010)  /* CTSD16 clock fault flag */
#define CTSD16RRIBURST        (0x0100)  /* Rail-to-rail input charge pump burst mode request */
#define CTSD16RRIRDY          (0x0200)  /* CTSD16 Rail-to-rail input ready */
#define CTSD16RRIERR          (0x0400)  /* CTSD16 Rail-to-rail input error */

#define CTSD16REFS_L        (0x0004)  /* CTSD16 reference select */
#define CTSD16CLKR_L        (0x0008)  /* CTSD16CLK resistor select */
#define CTSD16OFFG_L        (0x0010)  /* CTSD16 clock fault flag */

#define CTSD16RRIBURST_H    (0x0001)  /* Rail-to-rail input charge pump burst mode request */
#define CTSD16RRIRDY_H      (0x0002)  /* CTSD16 Rail-to-rail input ready */
#define CTSD16RRIERR_H      (0x0004)  /* CTSD16 Rail-to-rail input error */


/* CTSD16CCTLx */
#define CTSD16GRP              (0x0001)  /* CTSD16 group */
#define CTSD16SC               (0x0002)  /* CTSD16 Start Conversion */
#define CTSD16DF               (0x0010)  /* CTSD16 Data Format */
#define CTSD16LSBACC           (0x0040)  /* CTSD16 LSB access */
#define CTSD16LSBTOG           (0x0080)  /* CTSD16 LSB toggle */
#define CTSD16OSR0             (0x0100)  /* CTSD16 Channel OverSampling Ratio 0 */
#define CTSD16OSR1             (0x0200)  /* CTSD16 Channel OverSampling Ratio 1 */
#define CTSD16SNGL             (0x0400)  /* CTSD16 Channel Single Conversion Mode */

#define CTSD16GRP_L         (0x0001)  /* CTSD16 group */
#define CTSD16SC_L          (0x0002)  /* CTSD16 Start Conversion */
#define CTSD16DF_L          (0x0010)  /* CTSD16 Data Format */
#define CTSD16LSBACC_L      (0x0040)  /* CTSD16 LSB access */
#define CTSD16LSBTOG_L      (0x0080)  /* CTSD16 LSB toggle */

#define CTSD16OSR0_H        (0x0001)  /* CTSD16 Channel OverSampling Ratio 0 */
#define CTSD16OSR1_H        (0x0002)  /* CTSD16 Channel OverSampling Ratio 1 */
#define CTSD16SNGL_H        (0x0004)  /* CTSD16 Channel Single Conversion Mode */

#define CTSD16OSR_0            (0x0000)  /* CTSD16 Channel OverSampling Ratio 0 */
#define CTSD16OSR_1            (0x0100)  /* CTSD16 Channel OverSampling Ratio 1 */
#define CTSD16OSR_2            (0x0200)  /* CTSD16 Channel OverSampling Ratio 2 */
#define CTSD16OSR_3            (0x0300)  /* CTSD16 Channel OverSampling Ratio 3 */

#define CTSD16OSR__256         (0x0000)  /* CTSD16 Channel OverSampling Ratio: 256 */
#define CTSD16OSR__128         (0x0100)  /* CTSD16 Channel OverSampling Ratio: 128 */
#define CTSD16OSR__64          (0x0200)  /* CTSD16 Channel OverSampling Ratio:  64 */
#define CTSD16OSR__32          (0x0300)  /* CTSD16 Channel OverSampling Ratio:  32 */


/* CTSD16INCTLx */
#define CTSD16INCH0           (0x0001)  /* CTSD16 Input Channel select 0 */
#define CTSD16INCH1           (0x0002)  /* CTSD16 Input Channel select 1 */
#define CTSD16INCH2           (0x0004)  /* CTSD16 Input Channel select 2 */
#define CTSD16INCH3           (0x0008)  /* CTSD16 Input Channel select 3 */
#define CTSD16INCH4           (0x0010)  /* CTSD16 Input Channel select 4 */
#define CTSD16GAIN0           (0x0020)  /* CTSD16 Input Pre-Amplifier Gain Select 0 */
#define CTSD16GAIN1           (0x0040)  /* CTSD16 Input Pre-Amplifier Gain Select 1 */
#define CTSD16GAIN2           (0x0080)  /* CTSD16 Input Pre-Amplifier Gain Select 2 */
#define CTSD16INTDLY          (0x0100)  /* CTSD16 Interrupt Delay after 1.Conversion */
#define CTSD16BUFOFF          (0x0400)  /* CTSD16 Controls input buffer */
#define CTSD16RRI             (0x0800)  /* CTSD16 Rail-to-rail input enable */

#define CTSD16INCH0_L       (0x0001)  /* CTSD16 Input Channel select 0 */
#define CTSD16INCH1_L       (0x0002)  /* CTSD16 Input Channel select 1 */
#define CTSD16INCH2_L       (0x0004)  /* CTSD16 Input Channel select 2 */
#define CTSD16INCH3_L       (0x0008)  /* CTSD16 Input Channel select 3 */
#define CTSD16INCH4_L       (0x0010)  /* CTSD16 Input Channel select 4 */
#define CTSD16GAIN0_L       (0x0020)  /* CTSD16 Input Pre-Amplifier Gain Select 0 */
#define CTSD16GAIN1_L       (0x0040)  /* CTSD16 Input Pre-Amplifier Gain Select 1 */
#define CTSD16GAIN2_L       (0x0080)  /* CTSD16 Input Pre-Amplifier Gain Select 2 */

#define CTSD16INTDLY_H      (0x0001)  /* CTSD16 Interrupt Delay after 1.Conversion */
#define CTSD16BUFOFF_H      (0x0004)  /* CTSD16 Controls input buffer */
#define CTSD16RRI_H         (0x0008)  /* CTSD16 Rail-to-rail input enable */

#define CTSD16GAIN_1          (0x0000)  /* CTSD16 Input Pre-Amplifier Gain Select *1  */
#define CTSD16GAIN_2          (0x0020)  /* CTSD16 Input Pre-Amplifier Gain Select *2  */
#define CTSD16GAIN_4          (0x0040)  /* CTSD16 Input Pre-Amplifier Gain Select *4  */
#define CTSD16GAIN_8          (0x0060)  /* CTSD16 Input Pre-Amplifier Gain Select *8  */
#define CTSD16GAIN_16         (0x0080)  /* CTSD16 Input Pre-Amplifier Gain Select *16 */

#define CTSD16INCH_0          (0x0000)  /* CTSD16 Input Channel select A0 */
#define CTSD16INCH_1          (0x0001)  /* CTSD16 Input Channel select A1 */
#define CTSD16INCH_2          (0x0002)  /* CTSD16 Input Channel select A2 */
#define CTSD16INCH_3          (0x0003)  /* CTSD16 Input Channel select A3 */
#define CTSD16INCH_4          (0x0004)  /* CTSD16 Input Channel select A4 */
#define CTSD16INCH_5          (0x0005)  /* CTSD16 Input Channel select A5 */
#define CTSD16INCH_6          (0x0006)  /* CTSD16 Input Channel select Temp */
#define CTSD16INCH_7          (0x0007)  /* CTSD16 Input Channel select Vcc */
#define CTSD16INCH_8          (0x0008)  /* CTSD16 Input Channel select VBat */
#define CTSD16INCH_9          (0x0009)  /* CTSD16 Input Channel select AD0+ / AD0- */
#define CTSD16INCH_10         (0x000A)  /* CTSD16 Input Channel select AD0+ / VREF */
#define CTSD16INCH_11         (0x000B)  /* CTSD16 Input Channel select AD1+ / AD1- */
#define CTSD16INCH_12         (0x000C)  /* CTSD16 Input Channel select AD1+ / VREF*/
#define CTSD16INCH_13         (0x000D)  /* CTSD16 Input Channel select AD2+ / AD2- */
#define CTSD16INCH_14         (0x000E)  /* CTSD16 Input Channel select AD2+ / VREF*/
#define CTSD16INCH_15         (0x000F)  /* CTSD16 Input Channel select AD3+ / AD3 -*/
#define CTSD16INCH_16         (0x0010)  /* CTSD16 Input Channel select AD3+ / VREF*/
#define CTSD16INCH_17         (0x0011)  /* CTSD16 Input Channel select AD4x - VREF*/
#define CTSD16INCH_18         (0x0012)  /* CTSD16 Input Channel select AD4x - DAC0 */


/* CTSD16IFG */
#define CTSD16IFG0            (0x0001)  /* CTSD16 Channel 0 Interrupt Flag */
#define CTSD16OVIFG0          (0x0100)  /* CTSD16 Channel 0 Overflow Interrupt Flag */

#define CTSD16IFG0_L        (0x0001)  /* CTSD16 Channel 0 Interrupt Flag */

